In [3]:
import pandas as pd

In [4]:
data= [i for i in range(10)]

In [5]:
s=pd.Series(data)

In [6]:
d= { i:i**2 for i in range(5) }
d

{0: 0, 1: 1, 2: 4, 3: 9, 4: 16}

In [7]:

s=pd.Series(d)
s

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [8]:
data= {
    "name":['prajwal','yash','ashsih'],
    "age":[23,24,22],
    "job":["SE","CEO","SDE"]
}

df=pd.DataFrame(data)

In [9]:
df

      name  age  job
0  prajwal   23   SE
1     yash   24  CEO
2   ashsih   22  SDE

In [10]:
data= [ { "name":"prajwal" ,"age":23},
         { "name":"yash" ,"age":13},
         { "name":"ashis" ,"age":22}
      ]
df=pd.DataFrame(data)

In [11]:
df

      name  age
0  prajwal   23
1     yash   13
2    ashis   22

In [16]:
df=pd.read_csv('cars.csv')

In [17]:
df

      cars  speed
0      bmw    123
1  porsche    100
2  ferrari    140

In [29]:
#loc

df.loc[0]

cars     bmw
speed    123
Name: 0, dtype: object

In [30]:
df.iloc[0]

cars     bmw
speed    123
Name: 0, dtype: object

In [34]:
df.at[1,'speed']

100

In [38]:

df.iat[1,0]

'porsche'

In [39]:
df['avail']=[1,1,1]

In [40]:
df

      cars  speed  avail
0      bmw    123      1
1  porsche    100      1
2  ferrari    140      1

In [44]:
df.drop(['avail'],axis=1,inplace=True)

In [46]:
df['speed']=df['speed']+10

In [47]:
df

      cars  speed
0      bmw    133
1  porsche    110
2  ferrari    150

In [48]:
df.describe()

           speed
count    3.00000
mean   131.00000
std     20.07486
min    110.00000
25%    121.50000
50%    133.00000
75%    141.50000
max    150.00000

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   cars    3 non-null      object
 1   speed   3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [ ]:
df.ilo